# GOZLEM VE DEGISKEN SECIMI : loc and iLoc

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])

In [4]:
df

   var1  var2  var3
0    16     4    20
1    19    26     4
2     6     7    24
3     5     9    16
4    28     3    10
5     6    17     4
6    27    24    20
7    19    24    10
8     2    27     5
9     4    13    11

In [6]:
#loc - tanimlandigi sekliyle secim yapmak icin kullanilir.

In [8]:
df.loc[0:3] #loc'da 3'u de almis oldu.

   var1  var2  var3
0    16     4    20
1    19    26     4
2     6     7    24
3     5     9    16

In [9]:
#iloc - alisik olunan indexleme mantigiyla secim yapar.

In [10]:
df.iloc[0:3] #burada ise 3'u almadan gosterir.

   var1  var2  var3
0    16     4    20
1    19    26     4
2     6     7    24

In [11]:
#verilen indekslere sadik kalarak, tanimlandigi sekliyle secim yapmak icin loc kullaniliyor.
#iloc'da ise bilinen indeksleme mantigiyla secim yaptirmis oluyor. Klasik secim imkani kullanilir.

In [12]:
df.iloc[0,0]

16

In [13]:
df.iloc[:3,:2]

   var1  var2
0    16     4
1    19    26
2     6     7

In [15]:
df.loc[:3,"var3"]

0    20
1     4
2    24
3    16
Name: var3, dtype: int32

In [16]:
df.iloc[:3,1:3]

   var2  var3
0     4    20
1    26     4
2     7    24

In [17]:
df.iloc[0:3]["var3"]

0    20
1     4
2    24
Name: var3, dtype: int32